# Merito e Sorte

In [2]:
import tabula
import pandas as pd

In [7]:
dados = tabula.read_pdf("/home/renata/Desktop/Cursos/projetos/Meritocracia/inscritos_2020.pdf",
                        pages = "all")
len(dados)

2

In [9]:
dados[0].head()

,CODIGO,NOME,VAGAS,INSCRITOS,C/V,VAGAS AC,INSCRITOS AC,C/V AC,VAGAS EP,INSCRITOS EP,C/V EP,VAGAS PPI,INSCRITOS PPI,C/V PPI
0,100,"Administração, Ciências Contábeis, Economia, E...",187,1562,"8,35",93,1165,"12,53",59,312,"5,29",35,85,"2,43"
1,101,Administração - Piracicaba,40,283,"7,08",22,196,"8,91",11,70,"6,36",7,17,"2,43"
2,105,Arquitetura - FAU,105,2724,"25,94",67,1924,"28,72",27,599,"22,19",11,201,"18,27"
3,110,Arquitetura - São Carlos,31,622,"20,06",15,408,"27,2",10,178,"17,8",6,36,6
4,115,Artes Cênicas,30,667,"22,23",16,411,"25,69",8,185,"23,13",6,71,"11,83"

In [11]:
dados[1].head()

,500,Medicina,122,15794,"129,46",67,11031,"164,64",33,3484,"105,58",22,1279,"58,14"
0,501.0,Medicina - Bauru,42,5217,"124,21",26,3952,152,8,887,"110,88",8,378,"47,25"
1,505.0,Medicina - Ribeirão Preto,77,6856,"89,04",55,5183,"94,24",18,1418,"78,78",4,255,"63,75"
2,510.0,Medicina Veterinária,56,2403,"42,91",38,1607,"42,29",11,615,"55,91",7,181,"25,86"
3,515.0,Medicina Veterinária - Pirassununga,42,906,"21,57",24,624,26,10,224,"22,4",8,58,"7,25"
4,520.0,Nutrição,56,854,"15,25",40,600,15,12,203,"16,92",4,51,"12,75"

Os dados são duas páginas de uma mesma tabela, quando faz a leitura da segunda página (conforme feito acima) o tabula entende que a primeira linha é o cabeçalho e isso precisa ser modificado, pois caso não seja irá perder dados. O mesmo acontece, nesse caso, para as últimas linhas, já que elas possuem os totais.

In [13]:
#Ver últimas linhas
dados[1].tail()

,500,Medicina,122,15794,"129,46",67,11031,"164,64",33,3484,"105,58",22,1279,"58,14"
47,870.0,Química (Bacharelado e Bacharelado com Atribui...,e Qua4li2d,de e Ma1te7r3i,"is) -4 S,1ã2o",Carlos23,112,"4,87",11,52,"4,73",8,9,"1,13"
48,875.0,Sistemas de Informação - São Carlos,35,342,"9,77",19,217,"11,42",10,104,"10,4",6,21,"3,5"
49,999.0,Treinamento E (Exatas),300,3530,"11,77",180,3177,"17,65",75,308,"4,11",45,45,1
50,NaN,Total das Carreiras,9217,129148,"14,01",5964,94888,"15,91",2082,26368,"12,66",1171,7892,"6,74"
51,NaN,Total das Carreiras sem Treineiros,8317,117019,"14,07",5424,83841,"15,46",1857,25450,"13,7",1036,7728,"7,46"

In [14]:
#Retirando as duas últimas linhas
dados[1] = dados[1].iloc[:-2]
dados[1].tail()

,500,Medicina,122,15794,"129,46",67,11031,"164,64",33,3484,"105,58",22,1279,"58,14"
45,855.0,Química - Bacharelado e Licenciatura,84,752,"8,95",50,462,"9,24",20,220,11,14,70,5
46,865.0,Química - Licenciatura - Ribeirão Preto,28,61,"2,18",15,46,"3,07",8,10,"1,25",5,5,1
47,870.0,Química (Bacharelado e Bacharelado com Atribui...,e Qua4li2d,de e Ma1te7r3i,"is) -4 S,1ã2o",Carlos23,112,"4,87",11,52,"4,73",8,9,"1,13"
48,875.0,Sistemas de Informação - São Carlos,35,342,"9,77",19,217,"11,42",10,104,"10,4",6,21,"3,5"
49,999.0,Treinamento E (Exatas),300,3530,"11,77",180,3177,"17,65",75,308,"4,11",45,45,1

In [15]:
#Colocando o cabeçalho correto
dados_columns = dados[0].columns
linha_extra = dados[1].columns
dados[1].columns = dados_columns
dados[1].head()

,CODIGO,NOME,VAGAS,INSCRITOS,C/V,VAGAS AC,INSCRITOS AC,C/V AC,VAGAS EP,INSCRITOS EP,C/V EP,VAGAS PPI,INSCRITOS PPI,C/V PPI
0,501.0,Medicina - Bauru,42,5217,"124,21",26,3952,152,8,887,"110,88",8,378,"47,25"
1,505.0,Medicina - Ribeirão Preto,77,6856,"89,04",55,5183,"94,24",18,1418,"78,78",4,255,"63,75"
2,510.0,Medicina Veterinária,56,2403,"42,91",38,1607,"42,29",11,615,"55,91",7,181,"25,86"
3,515.0,Medicina Veterinária - Pirassununga,42,906,"21,57",24,624,26,10,224,"22,4",8,58,"7,25"
4,520.0,Nutrição,56,854,"15,25",40,600,15,12,203,"16,92",4,51,"12,75"

Percebe-se que a leitura dos dados da segunda página agora contém o cabeçalho correto, porém foi perdido uma linha, a linha do apêndice. Tem que colocar ela também, para que não haja nenhuma perda de informação.

In [16]:
dados.append(pd.DataFrame([linha_extra], columns=dados_columns))
dados[2].head()

,CODIGO,NOME,VAGAS,INSCRITOS,C/V,VAGAS AC,INSCRITOS AC,C/V AC,VAGAS EP,INSCRITOS EP,C/V EP,VAGAS PPI,INSCRITOS PPI,C/V PPI
0,500,Medicina,122,15794,"129,46",67,11031,"164,64",33,3484,"105,58",22,1279,"58,14"

Agora foi adicionado uma "terceira página" para resolver o problema da retirada da linha de medicina.

In [17]:
dados = pd.concat(dados)
dados.head()

,CODIGO,NOME,VAGAS,INSCRITOS,C/V,VAGAS AC,INSCRITOS AC,C/V AC,VAGAS EP,INSCRITOS EP,C/V EP,VAGAS PPI,INSCRITOS PPI,C/V PPI
0,100,"Administração, Ciências Contábeis, Economia, E...",187,1562,"8,35",93,1165,"12,53",59,312,"5,29",35,85,"2,43"
1,101,Administração - Piracicaba,40,283,"7,08",22,196,"8,91",11,70,"6,36",7,17,"2,43"
2,105,Arquitetura - FAU,105,2724,"25,94",67,1924,"28,72",27,599,"22,19",11,201,"18,27"
3,110,Arquitetura - São Carlos,31,622,"20,06",15,408,"27,2",10,178,"17,8",6,36,6
4,115,Artes Cênicas,30,667,"22,23",16,411,"25,69",8,185,"23,13",6,71,"11,83"

Utilizando a função "concat" da biblioteca pandas todas as partes das tabelas do arquivo em PDF foi colocado em apenas uma tabela.

In [18]:
len(dados)

109

Antes o tamanho do conjunto "dados" era mostrado apenas o tamanho 2, que era o número de páginas. Após adicionar todas as partes da tabela em uma só o tamanho mostrado é de quantos cursos possui, que nesse caso são 109 cursos.